{
  "store": {
    "7b694a6f-0bb7-4262-811c-8fd0e571a8bc": {
      "context": {
        "age": 73,
        "sex": "Male",
        "report_name": "CBC Old Man 2",
        "report_id": "7b694a6f-0bb7-4262-811c-8fd0e571a8bc"
      },
      "results": [
        {
          "test": "White Blood Cell (wbc)",
          "value": 6900.0,
          "unit": "/uL",
          "applied_range": {
            "low": 4500,
            "high": 11000,
            "source": "KB",
            "note": null,
            "unit": "cells/μL (microliter)"
          },
          "status": "normal",
          "source": "parsed"
        },
        {
          "test": "Red Blood Cell (rbc)",
          "value": 1.8,
          "unit": "million/µl",
          "applied_range": {
            "low": 4.32,
            "high": 5.72,
            "source": "KB",
            "note": null,
            "unit": "10^12/L"
          },
          "status": "low",
          "source": "parsed"
        },
        {
          "test": "Hemoglobin",
          "value": 6.5,
          "unit": "g/dL",
          "applied_range": {
            "low": 13.5,
            "high": 17.5,
            "source": "KB",
            "note": null,
            "unit": "g/dL"
          },
          "status": "low",
          "source": "parsed"
        },
        {
          "test": "Hematocrit",
          "value": 19.5,
          "unit": "%",
          "applied_range": {
            "low": 40,
            "high": 54,
            "source": "KB",
            "note": null
          },
          "status": "low",
          "source": "parsed"
        },
        {
          "test": "Mcv",
          "value": 109.6,
          "unit": "fL",
          "applied_range": {
            "low": 80,
            "high": 100,
            "source": "KB",
            "note": null,
            "unit": "fL"
          },
          "status": "high",
          "source": "parsed"
        },
        {
          "test": "Mch",
          "value": 36.5,
          "unit": "pg",
          "applied_range": {
            "low": 27.0,
            "high": 31.0,
            "source": "KB",
            "note": null,
            "unit": "pg/cell"
          },
          "status": "high",
          "source": "parsed"
        },
        {
          "test": "Mchc",
          "value": 33.3,
          "unit": "g/dL",
          "applied_range": {
            "low": 34.0,
            "high": 36.0,
            "source": "KB",
            "note": null,
            "unit": "g/dL"
          },
          "status": "low",
          "source": "parsed"
        },
        {
          "test": "Rdw",
          "value": 16.0,
          "unit": "%",
          "applied_range": {
            "low": 11.8,
            "high": 14.5,
            "source": "KB",
            "note": null,
            "unit": "%"
          },
          "status": "high",
          "source": "parsed"
        }
      ],
      "diet_plan": {
        "meals": [
          {
            "name": "Iron-Rich Breakfast",
            "ingredients": [
              "oatmeal",
              "spinach",
              "strawberries",
              "almonds"
            ],
            "instructions": "Cook oatmeal with milk or water, add fresh spinach and sliced strawberries, top with almonds",
            "why_this_meal": "To increase iron intake and support healthy red blood cells",
            "for_tests": [
              "Red Blood Cell (rbc)",
              "Hemoglobin",
              "Mch"
            ]
          },
          {
            "name": "B12 and Folate Boosting Salad",
            "ingredients": [
              "mixed greens",
              "grilled chicken",
              "avocado",
              "beans"
            ],
            "instructions": "Combine mixed greens, sliced grilled chicken, diced avocado, and canned beans, dress with olive oil and lemon juice",
            "why_this_meal": "To support B12 and folate levels, crucial for healthy red blood cells",
            "for_tests": [
              "Mcv",
              "Mch",
              "Rdw"
            ]
          },
          {
            "name": "Anemia-Fighting Soup",
            "ingredients": [
              "lentils",
              "vegetables",
              "lean beef"
            ],
            "instructions": "Cook lentils and vegetables in a broth made with lean beef, season with herbs",
            "why_this_meal": "To provide essential nutrients for combating anemia",
            "for_tests": [
              "Hematocrit",
              "Mchc"
            ]
          }
        ]
      },
      "summary_text": "For age 73 (Male), we reviewed 8 test(s): 7 flagged. • Red Blood Cell (rbc): 1.8 million/µl — low. Reference: 4.32–5.72 10^12/L (KB) • Hemoglobin: 6.5 g/dL — low. Reference: 13.5–17.5 g/dL (KB) • Hematocrit: 19.5 % — low. Reference: 40–54 (KB) • Mcv: 109.6 fL — high. Reference: 80–100 fL (KB) • Mch: 36.5 pg — high. Reference: 27.0–31.0 pg/cell (KB) • Mchc: 33.3 g/dL — low. Reference: 34.0–36.0 g/dL (KB) • Rdw: 16.0 % — high. Reference: 11.8–14.5 % (KB)",
      "per_test": [
        {
          "test": "White Blood Cell (wbc)",
          "value": 6900.0,
          "unit": "/uL",
          "status": "normal",
          "importance": "The White Blood Cell (WBC) test is important because it helps diagnose infections, inflammatory diseases, and blood disorders, allowing for timely and appropriate treatment.",
          "reason_high": "Common reasons for high WBC results include bacterial or viral infections, inflammatory diseases, allergic reactions, and bone marrow disorders.",
          "reason_low": "Common reasons for low WBC results include viral infections, autoimmune disorders, severe infections, and certain medications or treatments that suppress bone marrow activity.",
          "risks": "Abnormal WBC results can lead to risks such as untreated infections, delayed diagnosis of underlying conditions, and inappropriate treatment, which can worsen the condition and lead to serious health complications."
        },
        {
          "test": "Red Blood Cell (rbc)",
          "value": 1.8,
          "unit": "million/µl",
          "status": "low",
          "importance": "The Red Blood Cell (RBC) test is important because it helps diagnose and monitor conditions that affect red blood cells, such as anemia, blood disorders, and nutritional deficiencies.",
          "reason_high": "Common reasons for high RBC results include dehydration, smoking, living at high altitudes, and certain medical conditions like polycythemia vera.",
          "reason_low": "Common reasons for low RBC results include anemia, blood loss, bone marrow disorders, and certain chronic diseases like kidney disease or cancer.",
          "risks": "Abnormal RBC results can increase the risk of fatigue, weakness, pale skin, shortness of breath, and poor oxygen delivery to organs and tissues, potentially leading to serious health complications if left untreated."
        },
        {
          "test": "Hemoglobin",
          "value": 6.5,
          "unit": "g/dL",
          "status": "low",
          "importance": "Hemoglobin tests are crucial for diagnosing and monitoring conditions like anemia, which can lead to fatigue, weakness, and other complications if left untreated.",
          "reason_high": "Common reasons for high hemoglobin results include dehydration, polycythemia vera, chronic obstructive pulmonary disease (COPD), and living at high altitudes.",
          "reason_low": "Common reasons for low hemoglobin results include iron deficiency anemia, vitamin deficiency anemia, chronic diseases like kidney disease or cancer, and blood loss due to injury or surgery.",
          "risks": "Abnormal hemoglobin results can lead to risks such as organ damage, poor oxygen delivery to tissues, increased risk of infections, and in severe cases, heart failure or death if left untreated."
        },
        {
          "test": "Hematocrit",
          "value": 19.5,
          "unit": "%",
          "status": "low",
          "importance": "The hematocrit test is important because it measures the proportion of red blood cells in the blood, helping to diagnose and monitor conditions such as anemia, dehydration, and blood clotting disorders.",
          "reason_high": "Common reasons for high hematocrit results include dehydration, polycythemia vera, chronic obstructive pulmonary disease, and living at high altitudes.",
          "reason_low": "Common reasons for low hematocrit results include anemia, blood loss, leukemia, lymphoma, and rheumatoid arthritis.",
          "risks": "Abnormal hematocrit results can lead to risks such as inadequate oxygen delivery to tissues, increased risk of blood clots, and impaired immune function."
        },
        {
          "test": "Mcv",
          "value": 109.6,
          "unit": "fL",
          "status": "high",
          "importance": "The Mean Corpuscular Volume (MCV) test is important because it helps diagnose and monitor conditions affecting red blood cells, such as anemia.",
          "reason_high": "Common reasons for high MCV results include vitamin B12 or folate deficiency, alcoholism, and certain medications.",
          "reason_low": "Common reasons for low MCV results include iron deficiency anemia, thalassemia, and chronic diseases.",
          "risks": "Abnormal MCV results can lead to risks such as fatigue, weakness, shortness of breath, and increased risk of infections and cardiovascular disease."
        },
        {
          "test": "Mch",
          "value": 36.5,
          "unit": "pg",
          "status": "high",
          "importance": "The MCH test is important because it helps diagnose and monitor conditions affecting red blood cells, such as anemia, and provides insight into the body's iron storage and utilization.",
          "reason_high": "Common reasons for high MCH results include vitamin deficiency anemia, iron deficiency anemia, and other conditions that affect red blood cell production or destruction.",
          "reason_low": "Common reasons for low MCH results include conditions that lead to smaller than normal red blood cells, such as iron deficiency anemia, thalassemia, or sideroblastic anemia.",
          "risks": "Abnormal MCH results can indicate an increased risk of fatigue, weakness, pale skin, shortness of breath, and poor immune function, highlighting the need for further medical evaluation and potential treatment."
        },
        {
          "test": "Mchc",
          "value": 33.3,
          "unit": "g/dL",
          "status": "low",
          "importance": "The MCHC test is important because it helps diagnose and monitor conditions that affect red blood cells, such as anemia, and provides insight into the body's iron levels and overall health.",
          "reason_high": "Common reasons for high MCHC results include dehydration, which can concentrate the blood, and certain medical conditions like polycythemia, a disorder characterized by an overproduction of red blood cells.",
          "reason_low": "Common reasons for low MCHC results include iron deficiency anemia, vitamin deficiency anemia, and chronic diseases like kidney disease or cancer, which can affect the production of red blood cells and their ability to carry oxygen.",
          "risks": "Abnormal MCHC results can indicate an increased risk of fatigue, weakness, pale skin, shortness of breath, and in severe cases, heart problems, poor pregnancy outcomes, and impaired cognitive function."
        },
        {
          "test": "Rdw",
          "value": 16.0,
          "unit": "%",
          "status": "high",
          "importance": "The RDW test is important because it helps diagnose and monitor conditions affecting red blood cells, such as anemia, by measuring the variation in red blood cell size.",
          "reason_high": "Common reasons for high RDW results include iron deficiency anemia, vitamin deficiency anemia, and mixed anemia, as well as other conditions like chronic diseases and blood disorders.",
          "reason_low": "A low RDW result is typically not a cause for concern and may be seen in healthy individuals or those with conditions like polycythemia, where there's an increase in red blood cell production.",
          "risks": "Abnormal RDW results, especially high values, can indicate underlying health issues that, if left untreated, may lead to severe complications such as organ damage, poor oxygen delivery to tissues, and increased risk of infections and heart problems."
        }
      ],
      "disclaimer": "⚠️ NutriScope is an AI-powered tool designed to help you understand your lab reports. We use standard reference ranges for children, adults, and elderly patients, which may differ slightly from your testing laboratory’s ranges. Information and diet suggestions are educational only and should not replace consultation with a qualified healthcare professional.",
      "issues": null,
      "status": "analyzed",
      "meta": {
        "ocr_confidence": 0.97,
        "analyzer_version": "v2.0.0",
        "groq_used": false
      },
      "_debug_rows": [
        {
          "raw": "White Blood Cell (WBC)",
          "kb_key_in": "white blood cell (wbc)",
          "kb_key_resolved": "white blood cell (wbc)",
          "value": 6900.0,
          "unit": "/uL",
          "status": "normal",
          "applied": {
            "low": 4500,
            "high": 11000,
            "source": "KB",
            "note": null,
            "unit": "cells/μL (microliter)"
          }
        },
        {
          "raw": "Red Blood Cell (RBC)",
          "kb_key_in": "red blood cell (rbc)",
          "kb_key_resolved": "red blood cell (rbc)",
          "value": 1.8,
          "unit": "million/µl",
          "status": "low",
          "applied": {
            "low": 4.32,
            "high": 5.72,
            "source": "KB",
            "note": null,
            "unit": "10^12/L"
          }
        },
        {
          "raw": "Hemoglobin (HB/Hgb))",
          "kb_key_in": "hemoglobin",
          "kb_key_resolved": "hemoglobin",
          "value": 6.5,
          "unit": "g/dL",
          "status": "low",
          "applied": {
            "low": 13.5,
            "high": 17.5,
            "source": "KB",
            "note": null,
            "unit": "g/dL"
          }
        },
        {
          "raw": "Hematocrit (HCT) P",
          "kb_key_in": "hematocrit (hct) p",
          "kb_key_resolved": "hematocrit",
          "value": 19.5,
          "unit": "%",
          "status": "low",
          "applied": {
            "low": 40,
            "high": 54,
            "source": "KB",
            "note": null
          }
        },
        {
          "raw": "Mean Cell Volume (MCV)",
          "kb_key_in": "mcv",
          "kb_key_resolved": "mcv",
          "value": 109.6,
          "unit": "fL",
          "status": "high",
          "applied": {
            "low": 80,
            "high": 100,
            "source": "KB",
            "note": null,
            "unit": "fL"
          }
        },
        {
          "raw": "Mean Cell Hemoglobin (MCH)",
          "kb_key_in": "mch",
          "kb_key_resolved": "mch",
          "value": 36.5,
          "unit": "pg",
          "status": "high",
          "applied": {
            "low": 27.0,
            "high": 31.0,
            "source": "KB",
            "note": null,
            "unit": "pg/cell"
          }
        },
        {
          "raw": "Mean Cell Hb Conc (MCHC)",
          "kb_key_in": "mchc",
          "kb_key_resolved": "mchc",
          "value": 33.3,
          "unit": "g/dL",
          "status": "low",
          "applied": {
            "low": 34.0,
            "high": 36.0,
            "source": "KB",
            "note": null,
            "unit": "g/dL"
          }
        },
        {
          "raw": "Red Cell Dist Width (RDW)",
          "kb_key_in": "rdw",
          "kb_key_resolved": "rdw",
          "value": 16.0,
          "unit": "%",
          "status": "high",
          "applied": {
            "low": 11.8,
            "high": 14.5,
            "source": "KB",
            "note": null,
            "unit": "%"
          }
        }
      ],
      "id": "7b694a6f-0bb7-4262-811c-8fd0e571a8bc",
      "filename": "CBC-sample-report-with-notes_0.pdf"
    }
  },
  "order": [
    "7b694a6f-0bb7-4262-811c-8fd0e571a8bc"
  ]
}